quiz_data = [
     {
        "question": "Кто написал серию книг о Гарри Поттере?",
        "options": ["Дж. К. Роулинг", "Стивен Кинг", "Джордж Р. Р. Мартин", "Льюис Кэрролл"],
        "correct_option": 0
    },
    {
        "question": "Какой дом в Хогвартсе символизирует храбрость?",
        "options": ["Гриффиндор", "Слизерин", "Рейвенкло", "Пуффендуй"],
        "correct_option": 0
    },
    {
        "question": "Какое заклинание используется для левитации предметов?",
        "options": ["Авада Кедавра", "Левикорпус", "Вингардиум Левиоса", "Экспеллиармус"],
        "correct_option": 2
    },
    {
        "question": "Какой питомец у Гарри Поттера?",
        "options": ["Собака", "Кошка", "Сова", "Крыса"],
        "correct_option": 2
    },
    {
        "question": "Как зовут лучшего друга Гарри Поттера?",
        "options": ["Рон Уизли", "Гермиона Грейнджер", "Невилл Лонгботтом", "Драко Малфой"],
        "correct_option": 0
    },
    {
        "question": "Какой предмет изучают в Хогвартсе, чтобы научиться варить зелья?",
        "options": ["Защита от темных искусств", "Зельеварение", "Трансфигурация", "Астрономия"],
        "correct_option": 1
    },
    {
        "question": "Кто является директором Хогвартса в первой книге?",
        "options": ["Северус Снейп", "Альбус Дамблдор", "Рубеус Хагрид", "Минерва Макгонагалл"],
        "correct_option": 1
    },
    {
        "question": "Какой дракон достался Гарри на Турнире трех волшебников?",
        "options": ["Венгерская хвосторога", "Норвежский лесной дракон", "Китайский огненный шар", "Дракон из Шотландии"],
        "correct_option": 0
    },
    {
        "question": "Какой символ у Ровены Рейвенкло?",
        "options": ["Сова", "Орел", "Лев", "Заяц"],
        "correct_option": 1
    },
    {
        "question": "Какое заклинание используется для защиты от заклинаний?",
        "options": ["Экспеллиармус", "Протего", "Авада Кедавра", "Редукто"],
        "correct_option": 1
    }
]